import { DiaryDetail } from "@/types/diary";

export const getDataListDiary = async () => {
  // get api
  const list: DiaryDetail[] = [
    {
      timeDay: "2021.05.21",
      timeHour: "23:25",
      title: "私の日記の記録が一部表示されます。",
      detail:
        "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテトテキストテキストテキストテキス",
    },
    {
      timeDay: "2021.05.21",
      timeHour: "23:25",
      title: "私の日記の記録が一部表示されます。",
      detail:
        "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテトテキストテキストテキストテキス",
    },
    {
      timeDay: "2021.05.21",
      timeHour: "23:25",
      title: "私の日記の記録が一部表示されます。",
      detail:
        "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテトテキストテキストテキストテキス",
    },
    {
      timeDay: "2021.05.21",
      timeHour: "23:25",
      title: "私の日記の記録が一部表示されます。",
      detail:
        "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテトテキストテキストテキストテキス",
    },
    {
      timeDay: "2021.05.21",
      timeHour: "23:25",
      title: "私の日記の記録が一部表示されます。",
      detail:
        "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテトテキストテキストテキストテキス",
    },
    {
      timeDay: "2021.05.21",
      timeHour: "23:25",
      title: "私の日記の記録が一部表示されます。",
      detail:
        "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテトテキストテキストテキストテキス",
    },
    {
      timeDay: "2021.05.21",
      timeHour: "23:25",
      title: "私の日記の記録が一部表示されます。",
      detail:
        "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテトテキストテキストテキストテキス",
    },
    {
      timeDay: "2021.05.21",
      timeHour: "23:25",
      title: "私の日記の記録が一部表示されます。",
      detail:
        "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテトテキストテキストテキストテキス",
    },
  ];
  return list;
};
